	; ********************************************
	; File: strings.asm
	; Various subroutines-utilities in the assembly
	; language for the Vector 06c personal computer.
	; @author Sergey S. (der.fremd@gmail.com)
 	; @version 1.0
	; ********************************************
	
	; ---------------------------------
	; Текст в кодировке KOI8-R
	; ---------------------------------
str_test:
	DEFB $10,7,$11,8 ; сменить цвет
    DEFM "СЪЕШЬ ЖЕ ЕЩЁ ЭТИХ МЯГКИХ ФРАНЦУЗСКИХ БУЛОК ДА ВЫПЕЙ ЧАЮ.",0x0a
    DEFM "Код 0x10 меняет цвет символов: "
    DEFB $10,6 ; сменить цвет символов
    DEFM $0a,"Съешь же ещё этих мягких французских булок да выпей чаю!",0x0a
    DEFM "Код 0x11 меняет цвет подложки символов: "
    DEFM $10,15 ; сменить цвет символов
    DEFB $11,8 ; сменить цвет фона симфолов    
    DEFM "The quick brown fox jumps over the lazy dog. "
    DEFM "THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG"
    DEFM $10,15,$11,0,"a$=(12/3+456*78-90)^√2"
    DEFB $10,7,$11,8 ; сменить цвет
    DEFB $16,1,20 ; сменить координату
    DEFM "Новая координата CUR 1,26"
    DEFB $16,2,19 ; сменить координату
    DEFM "Новая координата CUR 2,25",$0a
    DEFB $10,15,$11,0 ; сменить цвет
    DEFM "В этой строке есть ",$10,3,"сим",$7f,"вол",$10,15," \"Backspace\" (0x7f) в слове \"символ\".",$0a
    DEFB $10,3 ; сменить цвет символов
    DEFB $11,0 ; сменить цвет фона симфолов
    DEFM "В этой строке есть символ",$0a,"перевода строки (LF 0x0A).",$0a
    DEFB $10,4 ; сменить цвет символов
    DEFM "Ниже символ CR (0x0D) перемещает          на начало этой",$10,5,$0d,"строки.",$0a
    DEFB $10,15 ; сменить цвет символов
    DEFM "Повтор",$10,7,$02,10,"я",$10,15,"ющийся символ после кода 0x02,nn, где nn - числоповторов.",$0a
    DEFB $10,15 ; сменить цвет символов
    DEFM "0",$09,"1",$09,"2",$09,"3",$09,"4",$09,"5",$09,"6",$09,"7",$09,"8"
    DEFB $11,6 ; сменить цвет фона симфолов
    DEFM " Та",$09,"бу",$09,"ля",$09,"ци",$09,"я",$09,"шириной",$09,"4.",$09
    DEFB $11,0 ; сменить цвет фона симфолов
    DEFB 0 ; терминатор строки

str_test2:
    DEFM $11,$00,"Другой заполнитель табуляции",$0a
    DEFM "Глава 1",$09,"10 c."
    DEFM "Глава 2",$09,"20 c."
	DEFM "Кодировка KOI8-R, символы и псевдографика: _\\#%&';<>?@{}[]`~"
	DEFB 128,129,130,131,132,133,134,135,136,138,139
	DEFB 140,142,141,143,144,144,145,145,146,146,147
	DEFB 148,149,150,151,152,153,154,155,156,157,158
	DEFB 159,160,161,162,164,165,166,167,168,169,170
	DEFB 171,172,173,174,175,176,177,178,179,180,181
	DEFB 182,183,184,185,186,187,188,189,190,191
	DEFM $0a,$10,4,"* Press space to testing speed *"
    DEFB 0 ; терминатор строки

